# Chapter 4. Inserting, Updating, and Deleting

In [1]:
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

## 4.1 Inserting a New Record

In [2]:
%%sql
insert into dept (deptno, dname, loc)
values (50, 'PROGRAMMING', 'BALTIMORE')
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(50, 'PROGRAMMING', 'BALTIMORE')]

## 4.2 Inserting Default Values

In [3]:
%%sql
create table if not exists d
(
    id integer default 0
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.

[]

In [4]:
%%sql
insert into d (id)
values (default)
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(0,)]

In [5]:
%%sql
insert into d default
values
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(0,)]

In [6]:
%%sql
create table if not exists d2
(
    id  integer default 0,
    foo varchar(10)
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.

[]

In [7]:
%%sql
insert into d2 (foo)
values ('Bar')
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(0, 'Bar')]

## 4.3 Overriding a Default Value with NULL

In [8]:
%%sql
create table if not exists d2
(
    id  integer default 0,
    foo varchar(10)
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.

[]

In [9]:
%%sql
insert into d2 (foo)
values (null)
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(0, None)]

In [10]:
%%sql
insert into d2 (id, foo)
values (null, 'Brighten')
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(None, 'Brighten')]

## 4.4 Copying Rows from One Table into Another

In [11]:
%%sql
create table if not exists dept_east as (
    select deptno, dname, loc
    from dept
    where loc = 'NEW YORK'
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[]

In [12]:
%%sql
insert into dept_east (deptno, dname, loc) (
    select deptno, dname, loc
    from dept
    where loc = 'BOSTON'
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[]

## 4.5 Copying a Table Definition

In [13]:
%%sql
create table if not exists dept_2
(
    like dept
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.

[]

## 4.6 Inserting into Multiple Tables at Once

In [14]:
%%sql
create table if not exists dept_east
(
    like dept
);
create table if not exists dept_mid
(
    like dept
);
create table if not exists dept_west
(
    like dept
);

with--
    east as (
        insert into dept_east (
            select deptno, dname, loc
            from dept
            where loc in ('NEW YORK', 'BOSTON')
        )
    ),
    west as (
        insert into dept_west (
            select deptno, dname, loc
            from dept
            where loc not in ('NEW YORK', 'BOSTON', 'CHICAGO')
        )
    ),
    mid as (
        insert into dept_mid (
            select deptno, dname, loc
            from dept
            where loc = 'CHICAGO'
        )
    )
select 1 as success;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.
Done.
Done.
1 rows affected.

[(1,)]

## 4.7 Blocking Inserts to Certain Columns

In [15]:
%%sql
create view emp_view as
select empno, ename, job, hiredate, sal, deptno
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.

[]

In [16]:
%%sql
insert into emp_view
values (1, 'Jonathan', 'Editor', '14-MAR-2005', 0, 0)
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(1, 'Jonathan', 'Editor', datetime.date(2005, 3, 14), 0, 0)]

In [17]:
%%sql
select *
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
15 rows affected.

[(7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(2006, 2, 20), 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, datetime.date(2006, 2, 22), 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(2006, 9, 28), 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(2006, 9, 8), 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.date(2008, 1, 12), 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, datetime.date(2006, 12, 3), 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3000, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10),
 (1, 'Jonathan', 'Editor', None, datetime.date(2005, 3, 14), 0, None, 0)]

## 4.8 Modifying Records in a Table

In [18]:
%%sql
update emp
set sal = sal * 1.1
where deptno = 20
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[(7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 880, None, 20),
 (7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 3273, None, 20),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3300, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.date(2008, 1, 12), 1210, None, 20),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3300, None, 20)]

## 4.9 Updating When Corresponding Rows Exist

In [19]:
%%sql
with emp_bonus as (
    select *
    from (values (7369, 'SMITH'),
                 (7900, 'JAMES'),
                 (7934, 'MILLER'))
             as t(empno, ename)
)
update emp
set sal = sal * 1.2
where empno in (select empno from emp_bonus)
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(7900, 'JAMES', 'CLERK', 7698, datetime.date(2006, 12, 3), 1140, None, 30),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1560, None, 10),
 (7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 1056, None, 20)]

## 4.10 Updating with Values from Another Table

In [20]:
%%sql
with new_sal as (
    select *
    from (values (10, 4000))
             as t(deptno, sal)
)
update emp
set sal  = new_sal.sal,
    comm = new_sal.sal / 2.
from new_sal
where emp.deptno = new_sal.deptno
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 4000, 2000, 10, 10, 4000),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 4000, 2000, 10, 10, 4000),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 4000, 2000, 10, 10, 4000)]

## 4.11 Merging Records
## 4.12 Deleting All Records from a Table

In [21]:
%%sql
truncate dept_east, dept_mid, dept_west;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
Done.

[]

## 4.13 Deleting Specific Records

In [22]:
%%sql
create table if not exists emp_2 as (
    select *
    from emp
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
15 rows affected.

[]

In [23]:
%%sql
delete
from emp_2
where deptno = 10
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 4000, 2000, 10),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 4000, 2000, 10),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 4000, 2000, 10)]

## 4.14 Deleting a Single Record

In [24]:
%%sql
delete
from emp_2
where empno = 7521
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(7521, 'WARD', 'SALESMAN', 7698, datetime.date(2006, 2, 22), 1250, 500, 30)]

## 4.15 Deleting Referential Integrity Violations

In [25]:
%%sql
delete
from emp_2
where deptno not in (
    select deptno
    from dept
)
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
1 rows affected.

[(1, 'Jonathan', 'Editor', None, datetime.date(2005, 3, 14), 0, None, 0)]

## 4.16 Deleting Duplicate Records

In [26]:
%%sql
create table if not exists dupes as (
    select *
    from (values (1, 'NAPOLEON'),
                 (2, 'DYNAMITE'),
                 (3, 'DYNAMITE'),
                 (4, 'SHE SELLS'),
                 (5, 'SEA SHELLS'),
                 (6, 'SEA SHELLS'),
                 (7, 'SEA SHELLS'))
             as t(id, name)
);

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
7 rows affected.

[]

In [27]:
%%sql
delete
from dupes
where id not in (
    select min(id)
    from dupes
    group by name
)
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
3 rows affected.

[(3, 'DYNAMITE'), (6, 'SEA SHELLS'), (7, 'SEA SHELLS')]

## 4.17 Deleting Records Referenced from Another Table

In [28]:
%%sql
with dept_accidents as (
    select *
    from (values (10, 'BROKEN FOOT'),
                 (10, 'FLESH WOUND'),
                 (20, 'FIRE'),
                 (20, 'FIRE'),
                 (20, 'FLOOD'),
                 (30, 'BRUISED GLUTE'))
             as t(deptno, accident_name)
)
delete
from emp_2
where deptno in (
    select deptno
    from dept_accidents
    group by deptno
    having count(accident_name) >= 3
)
returning *;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[(7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 3273, None, 20),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3300, None, 20),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.date(2008, 1, 12), 1210, None, 20),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3300, None, 20),
 (7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 1056, None, 20)]